{"task_type": "SEQ_2_SEQ_LM", "peft_type": "LORA", "auto_mapping": null, "base_model_name_or_path": null, "revision": null, "inference_mode": false, "r": 16, "target_modules": ["q", "v"], "exclude_modules": null, "lora_alpha": 32, "lora_dropout": 0.05, "fan_in_fan_out": false, "bias": "none", "use_rslora": false, "modules_to_save": null, "init_lora_weights": true, "layers_to_transform": null, "layers_pattern": null, "rank_pattern": {}, "alpha_pattern": {}, "megatron_config": null, "megatron_core": "megatron.core", "trainable_token_indices": null, "loftq_config": {}, "eva_config": null, "corda_config": null, "use_dora": false, "use_qalora": false, "qalora_group_size": 16, "layer_replication": null, "lora_bias": false, "target_parameters": null}